{"type":"network","version":"1.0","data":"data.json","logo":{"text":"Griff\u0027s Graph","file":"./images/name.png","link":"http://www.brendangriffen.com"},"text":{"title":"The Graph Of Influential Thinkers","more":"Clustering was calculated using a force algorithm which attracts similarly connected nodes and repels unconnected nodes. Each color was determined using a secondary algorithm based on modularity - this highlights the schools of thought they generally belong to (philosophy, art, comedy, political theory etc.). The bigger the node, the bigger influence they have on the network. Try searching for your favourite thinker or selecting a group based on colour. For the sake of speed, many smaller names had to be excluded, though their nodes still appear. The graph is incomplete and biased towards the type of people who entered the information into Wikipedia. It is not complete in any way nor accurately represents the true influences of each of those pictured. It was created using a combinination of SPARQL, dbpedia and Gephi; all freely available to the public.  ","intro":"This network shows the connections between everyone on Wikipedia who has an infobox containing the category \u0027influences\u0027 or \u0027influenced by\u0027. Clicking on a person will bring up all the people they either influenced or were influenced by. This can be used as a tool to find new artists, authors and philosophers similar to your current personal preferences."},"legend":{"edgeLabel":"influenced","colorLabel":"similar","nodeLabel":"thinker"},"features":{"search":true,"groupSelectorAttribute":"color","hoverBehavior":"Dim"},"informationPanel":{"imageAttribute":"Label","groupByEdgeDirection":false},"sigma":{"graphProperties":{"minEdgeSize":0.2,"maxNodeSize":7,"maxEdgeSize":0.5,"minNodeSize":1},"drawingProperties":{"labelThreshold":5,"hoverFontStyle":"bold","defaultEdgeType":"curve","defaultLabelColor":"#000","defaultLabelHoverColor":"#fff","defaultLabelSize":14,"activeFontStyle":"bold","fontStyle":"bold","defaultHoverLabelBGColor":"#002147","defaultLabelBGColor":"#ddd"},"mouseProperties":{"minRatio":0.75,"maxRatio":20}}}